loadtest/jmeter/order-callback-batch-refund-flow.jmx
<?xml version="1.0" encoding="UTF-8"?>
<jmeterTestPlan version="1.2" properties="5.0" jmeter="5.6.3">
  <hashTree>
    <TestPlan guiclass="TestPlanGui" testclass="TestPlan" testname="Order Callback Batch Refund Flow" enabled="true">
      <stringProp name="TestPlan.comments">Send payment success callbacks concurrently and verify async inbox + batch refund processing.</stringProp>
      <boolProp name="TestPlan.functional_mode">false</boolProp>
      <boolProp name="TestPlan.tearDown_on_shutdown">true</boolProp>
      <boolProp name="TestPlan.serialize_threadgroups">false</boolProp>
      <elementProp name="TestPlan.user_defined_variables" elementType="Arguments" guiclass="ArgumentsPanel" testclass="Arguments" testname="User Defined Variables" enabled="true">
        <collectionProp name="Arguments.arguments"/>
      </elementProp>
    </TestPlan>
    <hashTree>
      <ThreadGroup guiclass="ThreadGroupGui" testclass="ThreadGroup" testname="Payment Callback Users" enabled="true">
        <stringProp name="ThreadGroup.on_sample_error">continue</stringProp>
        <elementProp name="ThreadGroup.main_controller" elementType="LoopController" guiclass="LoopControlPanel" testclass="LoopController" testname="Loop Controller" enabled="true">
          <boolProp name="LoopController.continue_forever">false</boolProp>
          <stringProp name="LoopController.loops">1</stringProp>
        </elementProp>
        <stringProp name="ThreadGroup.num_threads">${__P(THREADS,500)}</stringProp>
        <stringProp name="ThreadGroup.ramp_time">${__P(RAMP_UP,1)}</stringProp>
        <boolProp name="ThreadGroup.scheduler">false</boolProp>
        <boolProp name="ThreadGroup.same_user_on_next_iteration">true</boolProp>
      </ThreadGroup>
      <hashTree>
        <CSVDataSet guiclass="TestBeanGUI" testclass="CSVDataSet" testname="Callback CSV" enabled="true">
          <stringProp name="delimiter">,</stringProp>
          <stringProp name="fileEncoding">UTF-8</stringProp>
          <stringProp name="filename">${__P(CALLBACK_CSV,loadtest-output/order-callback-batch-input.csv)}</stringProp>
          <boolProp name="ignoreFirstLine">true</boolProp>
          <boolProp name="quotedData">true</boolProp>
          <boolProp name="recycle">false</boolProp>
          <stringProp name="shareMode">shareMode.all</stringProp>
          <boolProp name="stopThread">true</boolProp>
          <stringProp name="variableNames">orderNo,externalTradeNo,paidAmountYuan,paymentProvider,delayMs,expectedOutcome</stringProp>
        </CSVDataSet>
        <hashTree/>
        <HeaderManager guiclass="HeaderPanel" testclass="HeaderManager" testname="HTTP Headers" enabled="true">
          <collectionProp name="HeaderManager.headers">
            <elementProp name="" elementType="Header">
              <stringProp name="Header.name">Accept</stringProp>
              <stringProp name="Header.value">application/json</stringProp>
            </elementProp>
            <elementProp name="" elementType="Header">
              <stringProp name="Header.name">Content-Type</stringProp>
              <stringProp name="Header.value">application/json</stringProp>
            </elementProp>
          </collectionProp>
        </HeaderManager>
        <hashTree/>
        <JSR223Sampler guiclass="TestBeanGUI" testclass="JSR223Sampler" testname="Prepare Callback Row" enabled="true">
          <stringProp name="cacheKey">order-callback-batch-prepare</stringProp>
          <stringProp name="script"><![CDATA[
def runId = props.getProperty('RUN_ID', 'local')
def threadNo = vars.get('__jm__Payment Callback Users__idx') ?: String.valueOf(ctx.getThreadNum())
def external = (vars.get('externalTradeNo') ?: '').trim()
if (external.isEmpty()) {
    external = "CB-${runId}-${threadNo}-${System.currentTimeMillis()}"
}
def provider = (vars.get('paymentProvider') ?: '').trim()
if (provider.isEmpty()) {
    provider = 'SIMULATED'
}
def amount = (vars.get('paidAmountYuan') ?: '').trim()
if (amount.isEmpty()) {
    amount = '0.00'
}
def delayText = (vars.get('delayMs') ?: '').trim()
long delayMs = delayText.isEmpty() ? 0L : Long.parseLong(delayText)
if (delayMs > 0L) {
    Thread.sleep(delayMs)
}
vars.put('callbackExternalTradeNo', external)
vars.put('callbackPaymentProvider', provider)
vars.put('callbackPaidAmountYuan', amount)
vars.put('callbackStartedAtMs', String.valueOf(System.currentTimeMillis()))
]]></stringProp>
          <stringProp name="scriptLanguage">groovy</stringProp>
        </JSR223Sampler>
        <hashTree/>
        <HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy" testname="POST Payment Callback Success" enabled="true">
          <boolProp name="HTTPSampler.postBodyRaw">true</boolProp>
          <elementProp name="HTTPsampler.Arguments" elementType="Arguments" guiclass="HTTPArgumentsPanel" testclass="Arguments" testname="User Defined Variables" enabled="true">
            <collectionProp name="Arguments.arguments">
              <elementProp name="" elementType="HTTPArgument">
                <boolProp name="HTTPArgument.always_encode">false</boolProp>
                <stringProp name="Argument.value">{
  "orderNo": "${orderNo}",
  "externalTradeNo": "${callbackExternalTradeNo}",
  "paidAmountYuan": ${callbackPaidAmountYuan},
  "paymentProvider": "${callbackPaymentProvider}"
}</stringProp>
                <stringProp name="Argument.metadata">=</stringProp>
              </elementProp>
            </collectionProp>
          </elementProp>
          <stringProp name="HTTPSampler.domain">${__P(HOST,localhost)}</stringProp>
          <stringProp name="HTTPSampler.port">${__P(PORT,6655)}</stringProp>
          <stringProp name="HTTPSampler.protocol">${__P(PROTOCOL,https)}</stringProp>
          <stringProp name="HTTPSampler.path">/shopping/api/payments/callback/success</stringProp>
          <stringProp name="HTTPSampler.method">POST</stringProp>
          <boolProp name="HTTPSampler.follow_redirects">true</boolProp>
          <boolProp name="HTTPSampler.auto_redirects">false</boolProp>
          <boolProp name="HTTPSampler.use_keepalive">true</boolProp>
          <boolProp name="HTTPSampler.DO_MULTIPART_POST">false</boolProp>
        </HTTPSamplerProxy>
        <hashTree>
          <ResponseAssertion guiclass="AssertionGui" testclass="ResponseAssertion" testname="HTTP 200" enabled="true">
            <collectionProp name="Asserion.test_strings">
              <stringProp name="49586">200</stringProp>
            </collectionProp>
            <stringProp name="Assertion.custom_message">Payment callback must be accepted.</stringProp>
            <stringProp name="Assertion.test_field">Assertion.response_code</stringProp>
            <boolProp name="Assertion.assume_success">false</boolProp>
            <intProp name="Assertion.test_type">8</intProp>
          </ResponseAssertion>
          <hashTree/>
          <ResponseAssertion guiclass="AssertionGui" testclass="ResponseAssertion" testname="Business Code Received" enabled="true">
            <collectionProp name="Asserion.test_strings">
              <stringProp name="code">ORDER_PAYMENT_CALLBACK_RECEIVED</stringProp>
            </collectionProp>
            <stringProp name="Assertion.custom_message">Callback API must return async received code.</stringProp>
            <stringProp name="Assertion.test_field">Assertion.response_data</stringProp>
            <boolProp name="Assertion.assume_success">false</boolProp>
            <intProp name="Assertion.test_type">2</intProp>
          </ResponseAssertion>
          <hashTree/>
          <JSR223PostProcessor guiclass="TestBeanGUI" testclass="JSR223PostProcessor" testname="Write Callback Result CSV" enabled="true">
            <stringProp name="cacheKey">order-callback-batch-write-result</stringProp>
            <stringProp name="script"><![CDATA[
import groovy.json.JsonSlurper
import java.nio.charset.StandardCharsets
import java.nio.file.Files
import java.nio.file.Path
import java.nio.file.StandardOpenOption

def output = props.getProperty('CALLBACK_RESULT_CSV', '')
if (!output) {
    return
}
def runId = props.getProperty('RUN_ID', 'local')
def callbackNo = ''
def status = ''
try {
    def json = new JsonSlurper().parseText(prev.getResponseDataAsString())
    callbackNo = json?.data?.callbackNo ?: ''
    status = json?.data?.status ?: ''
} catch (Throwable ignored) {
}
def csv = Path.of(output)
if (!Files.exists(csv)) {
    Files.createDirectories(csv.getParent())
    Files.writeString(csv, 'run_id,order_no,external_trade_no,paid_amount_yuan,payment_provider,expected_outcome,callback_no,accepted_status,http_code,callback_started_at_ms\n', StandardCharsets.UTF_8, StandardOpenOption.CREATE, StandardOpenOption.APPEND)
}
def esc = { value ->
    def text = value == null ? '' : String.valueOf(value)
    '"' + text.replace('"', '""') + '"'
}
def line = [
    runId,
    vars.get('orderNo'),
    vars.get('callbackExternalTradeNo'),
    vars.get('callbackPaidAmountYuan'),
    vars.get('callbackPaymentProvider'),
    vars.get('expectedOutcome'),
    callbackNo,
    status,
    prev.getResponseCode(),
    vars.get('callbackStartedAtMs')
].collect(esc).join(',') + '\n'
Files.writeString(csv, line, StandardCharsets.UTF_8, StandardOpenOption.CREATE, StandardOpenOption.APPEND)
]]></stringProp>
            <stringProp name="scriptLanguage">groovy</stringProp>
          </JSR223PostProcessor>
          <hashTree/>
        </hashTree>
        <ResultCollector guiclass="SummaryReport" testclass="ResultCollector" testname="Summary Report" enabled="true">
          <boolProp name="ResultCollector.error_logging">false</boolProp>
        </ResultCollector>
        <hashTree/>
      </hashTree>
    </hashTree>
  </hashTree>
</jmeterTestPlan>